# Crear Target

## Ejercicio 1:
Cree el archivo `competencia_01.csv`, usando el `competencia_01_crudo.csv` con una variable adicional llamada `clase_ternaria`, que contenga las categorías **CONTINUA**, **BAJA+1** y **BAJA+2** 

### Ayudita 

Para practicar el muy útil y necesario lenguaje **SQL**, vamos a utilizar una base de datos **OLAP** llamada **DuckDB**. 

La documentación la puede encontrar [aquí](https://duckdb.org/docs/archive/0.8.1/sql/introduction)
Procedemos a instalarla, esto se debe ejecutar una sola vez

In [1]:
##%%bash 
! pip install duckdb
! pip install jupysql
! pip install duckdb-engine

Collecting duckdb
  Obtaining dependency information for duckdb from https://files.pythonhosted.org/packages/ee/af/e3fdfa4776124e797d8303f85f3bd97e17f7a1aa1a90189b545369d267d1/duckdb-0.8.1-cp311-cp311-win_amd64.whl.metadata
  Downloading duckdb-0.8.1-cp311-cp311-win_amd64.whl.metadata (774 bytes)
Downloading duckdb-0.8.1-cp311-cp311-win_amd64.whl (9.8 MB)
   ---------------------------------------- 0.0/9.8 MB ? eta -:--:--
   - -------------------------------------- 0.3/9.8 MB 8.6 MB/s eta 0:00:02
   --- ------------------------------------ 0.8/9.8 MB 10.4 MB/s eta 0:00:01
   -------- ------------------------------- 2.1/9.8 MB 16.6 MB/s eta 0:00:01
   -------- ------------------------------- 2.1/9.8 MB 16.6 MB/s eta 0:00:01
   -------- ------------------------------- 2.1/9.8 MB 16.6 MB/s eta 0:00:01
   -------- ------------------------------- 2.1/9.8 MB 16.6 MB/s eta 0:00:01
   -------- ------------------------------- 2.1/9.8 MB 16.6 MB/s eta 0:00:01
   -------- ------------------------------- 2.1/9.8 MB 16.6 MB/s eta 0:00:01
   -------- ------------------------------- 2.1/9.8 MB 16.6 MB/s eta 0:00:01
   -------------- ------------------------- 3.5/9.8 MB 7.4 MB/s eta 0:00:01
   --------------------- ------------------ 5.4/9.8 MB 10.4 MB/s eta 0:00:01
   ----------------------------- ---------- 7.3/9.8 MB 12.9 MB/s eta 0:00:01
   ----------------------------- ---------- 7.3/9.8 MB 13.0 MB/s eta 0:00:01
   ------------------------------------ --- 9.0/9.8 MB 13.8 MB/s eta 0:00:01
   ---------------------------------------  9.8/9.8 MB 14.6 MB/s eta 0:00:01
   ---------------------------------------- 9.8/9.8 MB 13.6 MB/s eta 0:00:00
Installing collected packages: duckdb
Successfully installed duckdb-0.8.1
Collecting jupysql
  Obtaining dependency information for jupysql from https://files.pythonhosted.org/packages/15/8e/0a48cc2cb6ffeb4ca7c46f4c3e7dafe3ce461da5d5ec7650fe3e9e648f45/jupysql-0.10.0-py3-none-any.whl.metadata
  Downloading jupysql-0.10.0-py3-none-any.whl.metadata (5.5 kB)
Collecting prettytable (from jupysql)
  Obtaining dependency information for prettytable from https://files.pythonhosted.org/packages/25/1e/4c284713b092ec384fad4399452f43f6446ad9aabc9c0b3c3c0920cc53b6/prettytable-3.8.0-py3-none-any.whl.metadata
  Downloading prettytable-3.8.0-py3-none-any.whl.metadata (26 kB)
Requirement already satisfied: ipython in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from jupysql) (8.14.0)
Collecting sqlalchemy (from jupysql)
  Obtaining dependency information for sqlalchemy from https://files.pythonhosted.org/packages/10/81/230bec5713913a472003b71c8dd7e3572de44499e741df576fd6b39d82c8/SQLAlchemy-2.0.20-cp311-cp311-win_amd64.whl.metadata
  Downloading SQLAlchemy-2.0.20-cp311-cp311-win_amd64.whl.metadata (9.7 kB)
Collecting sqlparse (from jupysql)
  Downloading sqlparse-0.4.4-py3-none-any.whl (41 kB)
     ---------------------------------------- 0.0/41.2 kB ? eta -:--:--
     ---------------------------------------- 41.2/41.2 kB ? eta 0:00:00
Collecting ipython-genutils>=0.1.0 (from jupysql)
  Using cached ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Collecting sqlglot (from jupysql)
  Obtaining dependency information for sqlglot from https://files.pythonhosted.org/packages/2f/a9/d4eb9889414e99f8bc76fcb66449400aa8a57f33b593fb2e14201f92c606/sqlglot-17.15.0-py3-none-any.whl.metadata
  Downloading sqlglot-17.15.0-py3-none-any.whl.metadata (15 kB)
Requirement already satisfied: jinja2 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from jupysql) (3.1.2)
Collecting ploomber-core>=0.2.7 (from jupysql)
  Obtaining dependency information for ploomber-core>=0.2.7 from https://files.pythonhosted.org/packages/12/3b/6c0b6e07ddfa759f925a030353ba98f1f23ab45ea04a0c4b8888e2ef93b6/ploomber_core-0.2.14-py3-none-any.whl.metadata
  Downloading ploomber_core-0.2.14-py3-none-any.whl.metadata (498 bytes)
Collecting click (from ploomber-core>=0.2.7->jupysql)
  Obtaining dependency information for click from https://files.pythonhosted.org/packages/00/2e/d53fa4befbf2cfa713304affc7ca780ce4fc1fd8710527771b58311a3229/click-8.1.7-py3-none-any.whl.metadata
  Downloading click-8.1.7-py3-none-any.whl.metadata (3.0 kB)
Requirement already satisfied: pyyaml in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ploomber-core>=0.2.7->jupysql) (6.0.1)
Collecting posthog (from ploomber-core>=0.2.7->jupysql)
  Obtaining dependency information for posthog from https://files.pythonhosted.org/packages/a7/73/35758818228c70348be4c3c66a76653c62e894e0e3c3461453c5341ca926/posthog-3.0.2-py2.py3-none-any.whl.metadata
  Downloading posthog-3.0.2-py2.py3-none-any.whl.metadata (2.0 kB)
Requirement already satisfied: backcall in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (0.2.0)
Requirement already satisfied: decorator in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (0.19.0)
Requirement already satisfied: matplotlib-inline in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (0.1.6)
Requirement already satisfied: pickleshare in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (3.0.39)
Requirement already satisfied: pygments>=2.4.0 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (2.16.1)
Requirement already satisfied: stack-data in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (0.6.2)
Requirement already satisfied: traitlets>=5 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (5.9.0)
Requirement already satisfied: colorama in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from ipython->jupysql) (0.4.6)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from jinja2->jupysql) (2.1.3)
Requirement already satisfied: wcwidth in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from prettytable->jupysql) (0.2.6)
Collecting typing-extensions>=4.2.0 (from sqlalchemy->jupysql)
  Obtaining dependency information for typing-extensions>=4.2.0 from https://files.pythonhosted.org/packages/ec/6b/63cc3df74987c36fe26157ee12e09e8f9db4de771e0f3404263117e75b95/typing_extensions-4.7.1-py3-none-any.whl.metadata
  Downloading typing_extensions-4.7.1-py3-none-any.whl.metadata (3.1 kB)
Collecting greenlet!=0.4.17 (from sqlalchemy->jupysql)
  Downloading greenlet-2.0.2-cp311-cp311-win_amd64.whl (192 kB)
     ---------------------------------------- 0.0/192.5 kB ? eta -:--:--
     -------------------------------------- 192.5/192.5 kB 5.7 MB/s eta 0:00:00
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from jedi>=0.16->ipython->jupysql) (0.8.3)
Requirement already satisfied: requests<3.0,>=2.7 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from posthog->ploomber-core>=0.2.7->jupysql) (2.31.0)
Requirement already satisfied: six>=1.5 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from posthog->ploomber-core>=0.2.7->jupysql) (1.16.0)
Collecting monotonic>=1.5 (from posthog->ploomber-core>=0.2.7->jupysql)
  Downloading monotonic-1.6-py2.py3-none-any.whl (8.2 kB)
Collecting backoff>=1.10.0 (from posthog->ploomber-core>=0.2.7->jupysql)
  Downloading backoff-2.2.1-py3-none-any.whl (15 kB)
Requirement already satisfied: python-dateutil>2.1 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from posthog->ploomber-core>=0.2.7->jupysql) (2.8.2)
Requirement already satisfied: executing>=1.2.0 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from stack-data->ipython->jupysql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from stack-data->ipython->jupysql) (2.2.1)
Requirement already satisfied: pure-eval in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from stack-data->ipython->jupysql) (0.2.2)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from requests<3.0,>=2.7->posthog->ploomber-core>=0.2.7->jupysql) (3.2.0)
Requirement already satisfied: idna<4,>=2.5 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from requests<3.0,>=2.7->posthog->ploomber-core>=0.2.7->jupysql) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from requests<3.0,>=2.7->posthog->ploomber-core>=0.2.7->jupysql) (2.0.4)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from requests<3.0,>=2.7->posthog->ploomber-core>=0.2.7->jupysql) (2023.7.22)
Downloading jupysql-0.10.0-py3-none-any.whl (83 kB)
   ---------------------------------------- 0.0/83.7 kB ? eta -:--:--
   ---------------------------------------- 83.7/83.7 kB ? eta 0:00:00
Downloading ploomber_core-0.2.14-py3-none-any.whl (21 kB)
Downloading sqlglot-17.15.0-py3-none-any.whl (295 kB)
   ---------------------------------------- 0.0/295.9 kB ? eta -:--:--
   --------------------------------------- 295.9/295.9 kB 17.9 MB/s eta 0:00:00
Downloading prettytable-3.8.0-py3-none-any.whl (27 kB)
Downloading SQLAlchemy-2.0.20-cp311-cp311-win_amd64.whl (2.0 MB)
   ---------------------------------------- 0.0/2.0 MB ? eta -:--:--
   ---------------------------------- ----- 1.8/2.0 MB 54.4 MB/s eta 0:00:01
   ---------------------------------------- 2.0/2.0 MB 32.3 MB/s eta 0:00:00
Downloading typing_extensions-4.7.1-py3-none-any.whl (33 kB)
Downloading click-8.1.7-py3-none-any.whl (97 kB)
   ---------------------------------------- 0.0/97.9 kB ? eta -:--:--
   ---------------------------------------- 97.9/97.9 kB ? eta 0:00:00
Downloading posthog-3.0.2-py2.py3-none-any.whl (37 kB)
Installing collected packages: sqlglot, monotonic, ipython-genutils, typing-extensions, sqlparse, prettytable, greenlet, click, backoff, sqlalchemy, posthog, ploomber-core, jupysql
Successfully installed backoff-2.2.1 click-8.1.7 greenlet-2.0.2 ipython-genutils-0.2.0 jupysql-0.10.0 monotonic-1.6 ploomber-core-0.2.14 posthog-3.0.2 prettytable-3.8.0 sqlalchemy-2.0.20 sqlglot-17.15.0 sqlparse-0.4.4 typing-extensions-4.7.1
Collecting duckdb-engine
  Obtaining dependency information for duckdb-engine from https://files.pythonhosted.org/packages/f3/6c/17298ff413db694b87ce0e3eea1685ffe47987fb64e46cd6b673bac53177/duckdb_engine-0.9.2-py3-none-any.whl.metadata
  Downloading duckdb_engine-0.9.2-py3-none-any.whl.metadata (6.8 kB)
Requirement already satisfied: duckdb>=0.4.0 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from duckdb-engine) (0.8.1)
Requirement already satisfied: sqlalchemy>=1.3.22 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from duckdb-engine) (2.0.20)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from sqlalchemy>=1.3.22->duckdb-engine) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from sqlalchemy>=1.3.22->duckdb-engine) (2.0.2)
Downloading duckdb_engine-0.9.2-py3-none-any.whl (43 kB)
   ---------------------------------------- 0.0/43.1 kB ? eta -:--:--
   ---------------------------------------- 43.1/43.1 kB 2.2 MB/s eta 0:00:00
Installing collected packages: duckdb-engine
Successfully installed duckdb-engine-0.9.2

In [3]:
! pip install pandas

Collecting pandas
  Obtaining dependency information for pandas from https://files.pythonhosted.org/packages/9e/71/756a1be6bee0209d8c0d8c5e3b9fc72c00373f384a4017095ec404aec3ad/pandas-2.0.3-cp311-cp311-win_amd64.whl.metadata
  Downloading pandas-2.0.3-cp311-cp311-win_amd64.whl.metadata (18 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2023.3-py2.py3-none-any.whl (502 kB)
     ---------------------------------------- 0.0/502.3 kB ? eta -:--:--
     ------------- ------------------------ 174.1/502.3 kB 5.3 MB/s eta 0:00:01
     ------------------------------------ - 481.3/502.3 kB 5.1 MB/s eta 0:00:01
     -------------------------------------- 502.3/502.3 kB 5.3 MB/s eta 0:00:00
Collecting tzdata>=2022.1 (from pandas)
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     ---------------------------------------- 0.0/341.8 kB ? eta -:--:--
     ------------------------------------- 341.8/341.8 kB 20.7 MB/s eta 0:00:00
Collecting numpy>=1.21.0 (from pandas)
  Obtaining dependency information for numpy>=1.21.0 from https://files.pythonhosted.org/packages/72/b2/02770e60c4e2f7e158d923ab0dea4e9f146a2dbf267fec6d8dc61d475689/numpy-1.25.2-cp311-cp311-win_amd64.whl.metadata
  Downloading numpy-1.25.2-cp311-cp311-win_amd64.whl.metadata (5.7 kB)
Requirement already satisfied: six>=1.5 in c:\users\vanes\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.0.3-cp311-cp311-win_amd64.whl (10.6 MB)
   ---------------------------------------- 0.0/10.6 MB ? eta -:--:--
   ----- ---------------------------------- 1.5/10.6 MB 46.4 MB/s eta 0:00:01
   ------------ --------------------------- 3.3/10.6 MB 41.7 MB/s eta 0:00:01
   ------------------- -------------------- 5.1/10.6 MB 40.7 MB/s eta 0:00:01
   -------------------------- ------------- 6.9/10.6 MB 40.2 MB/s eta 0:00:01
   --------------------------------- ------ 8.8/10.6 MB 40.3 MB/s eta 0:00:01
   ---------------------------------------  10.6/10.6 MB 40.9 MB/s eta 0:00:01
   ---------------------------------------- 10.6/10.6 MB 34.4 MB/s eta 0:00:00
Downloading numpy-1.25.2-cp311-cp311-win_amd64.whl (15.5 MB)
   ---------------------------------------- 0.0/15.5 MB ? eta -:--:--
   ---- ----------------------------------- 1.8/15.5 MB 39.0 MB/s eta 0:00:01
   --------- ------------------------------ 3.6/15.5 MB 39.1 MB/s eta 0:00:01
   -------------- ------------------------- 5.5/15.5 MB 39.0 MB/s eta 0:00:01
   ------------------ --------------------- 7.3/15.5 MB 39.2 MB/s eta 0:00:01
   ---------------------- ----------------- 8.8/15.5 MB 37.8 MB/s eta 0:00:01
   --------------------------- ------------ 10.7/15.5 MB 38.5 MB/s eta 0:00:01
   ------------------------------- -------- 12.4/15.5 MB 38.5 MB/s eta 0:00:01
   ------------------------------------- -- 14.5/15.5 MB 38.5 MB/s eta 0:00:01
   ---------------------------------------  15.5/15.5 MB 38.5 MB/s eta 0:00:01
   ---------------------------------------- 15.5/15.5 MB 34.4 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-1.25.2 pandas-2.0.3 pytz-2023.3 tzdata-2023.3

Configuramos el entorno de ejecución. Si ya tiene todo instalado, solo necesita ejecutar esta celda para empezar a usar **duckdb**

In [1]:
import duckdb
import pandas as pd

%load_ext sql
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

%sql duckdb:///:default:

Y ya podemos usar **SQL** dentro de una notebook!

In [2]:
%%sql
select 'hola mundo'

  'hola mundo'
0   hola mundo

Para cargar el archivo `.csv` a una tabla:

In [2]:
%%sql
create or replace table competencia_01 as 
select 
    *
from read_csv_auto('C:\Users\vanes\Documents\UBA\2do_cuatrimestre\DMEyF\datasets\competencia_01_crudo.csv')

Empty DataFrame
Columns: [Success]
Index: []

Hagamos unas queries básicas para comprobar que todo esta funcionando bien.

In [4]:
%sql select * from competencia_01 limit 5

,numero_de_cliente,foto_mes,active_quarter,cliente_vip,internet,cliente_edad,cliente_antiguedad,mrentabilidad,mrentabilidad_annual,mcomisiones,...,Visa_madelantodolares,Visa_fultimo_cierre,Visa_mpagado,Visa_mpagospesos,Visa_mpagosdolares,Visa_fechaalta,Visa_mconsumototal,Visa_cconsumos,Visa_cadelantosefectivo,Visa_mpagominimo
0,29183981,202103,1,0,0,50,197,14468.81,125765.29,2389.82,...,0.0,7,0.00,-114954.00,0.00,5938,101050.66,68,0,71811.06
1,29184630,202103,1,0,0,59,322,11901.57,74158.93,18750.68,...,0.0,1,0.00,-40330.15,17.59,4089,26834.09,7,0,3894.36
2,29185433,202103,1,0,0,68,268,847.15,21672.47,481.62,...,0.0,21,4692.00,-1173.00,0.00,7829,1651.36,3,0,1560.09
3,29185587,202103,1,0,0,79,322,4976.94,47735.98,1839.31,...,0.0,1,0.00,-15988.67,0.00,7580,30025.29,11,0,1700.85
4,29185646,202103,1,0,0,60,257,2860.45,37800.71,4035.40,...,0.0,21,380616.14,-97383.25,0.00,7827,359610.70,31,0,15600.90

In [5]:
%%sql
select 
    foto_mes
    , count(*) as cantidad -- cuenta cuantos casos hay en cada foto_mes 
                           -- y lo guarda en un campo llamado cantidad
from competencia_01
group by foto_mes

   foto_mes  cantidad
0    202103    163324
1    202104    163637
2    202105    164102

In [34]:
%%sql
SELECT count(*) FROM competencia_01

   count_star()
0        491063

In [4]:
%%sql
SELECT COUNT(DISTINCT numero_de_cliente) FROM competencia_01

   count(DISTINCT numero_de_cliente)
0                             166120

Perfecto, ahora cree una nueva tabla con la variable adicional que se le pide. Algunas funciones que le pueden ser útiles:  [where](https://duckdb.org/docs/sql/query_syntax/where), [left join](https://duckdb.org/docs/sql/query_syntax/from), [case statement](https://duckdb.org/docs/sql/expressions/case)

Con esto creo columna con el primer mes en el que aparece el cliente

In [55]:
%%sql

SELECT numero_de_cliente,
       MIN(foto_mes) OVER (PARTITION BY numero_de_cliente) AS primer_mes
FROM competencia_01

        numero_de_cliente  primer_mes
0                29185646      202103
1                29185646      202103
2                29185646      202103
3                29188883      202103
4                29188883      202103
...                   ...         ...
491058          186316072      202104
491059          186316072      202104
491060          186332374      202104
491061          186332374      202104
491062          186627721      202105

[491063 rows x 2 columns]

Con esto hago un pivot de la tabla a partir del campo foto_mes

In [54]:
%%sql 

WITH base AS (
        SELECT *,
                MIN(foto_mes) OVER (PARTITION BY numero_de_cliente) AS primer_mes              
        FROM competencia_01
    )
    SELECT
        numero_de_cliente,
        primer_mes,
        MAX(CASE WHEN foto_mes = 202103 THEN 1 ELSE 0 END) AS foto_mes_202103,
        MAX(CASE WHEN foto_mes = 202104 THEN 1 ELSE 0 END) AS foto_mes_202104,
        MAX(CASE WHEN foto_mes = 202105 THEN 1 ELSE 0 END) AS foto_mes_202105,
    FROM base
    WHERE numero_de_cliente = 29185646
    GROUP BY numero_de_cliente, primer_mes

,numero_de_cliente,primer_mes,foto_mes_202103,foto_mes_202104,foto_mes_202105
0,29185646,202103,1,1,1

### Query final

In [57]:
%%sql 
WITH agg AS (
    WITH min AS (
        SELECT *,
                MIN(foto_mes) OVER (PARTITION BY numero_de_cliente) AS primer_mes              
        FROM competencia_01
    )
    SELECT
        numero_de_cliente,
        primer_mes,
        MAX(CASE WHEN foto_mes = 202103 THEN 1 ELSE 0 END) AS foto_mes_202103,
        MAX(CASE WHEN foto_mes = 202104 THEN 1 ELSE 0 END) AS foto_mes_202104,
        MAX(CASE WHEN foto_mes = 202105 THEN 1 ELSE 0 END) AS foto_mes_202105,
    FROM min
    GROUP BY numero_de_cliente, primer_mes
)
SELECT c.*,
    CASE 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 1) THEN 'CONTINUA'
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 1) THEN 'CONTINUA' 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 0) THEN 'BAJA+1' 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 0) THEN 'BAJA+2'
        WHEN (primer_mes = 202104) AND (foto_mes_202105 = 0)  THEN 'BAJA+1'
        ELSE NULL END AS clase_ternaria         
FROM agg
LEFT JOIN competencia_01 c
ON c.numero_de_cliente = agg.numero_de_cliente

,numero_de_cliente,foto_mes,active_quarter,cliente_vip,internet,cliente_edad,cliente_antiguedad,mrentabilidad,mrentabilidad_annual,mcomisiones,...,Visa_fultimo_cierre,Visa_mpagado,Visa_mpagospesos,Visa_mpagosdolares,Visa_fechaalta,Visa_mconsumototal,Visa_cconsumos,Visa_cadelantosefectivo,Visa_mpagominimo,clase_ternaria
0,29210728,202104,1,0,2,79,290,2552.07,22448.70,1607.58,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,CONTINUA
1,29300548,202104,1,0,0,66,323,-4443.89,12867.82,6807.16,...,23.0,54377.49,-48749.14,0.0,9242.0,23292.76,16.0,0.0,12375.15,CONTINUA
2,29314255,202104,1,0,0,52,39,-4671.14,3843.72,3637.27,...,2.0,0.00,-80280.12,0.0,557.0,9301.46,5.0,0.0,116983.29,CONTINUA
3,29365322,202104,1,0,0,87,323,-826.40,9778.47,-801.62,...,23.0,6500.93,-6500.93,0.0,9213.0,6423.84,3.0,0.0,328.44,CONTINUA
4,29371215,202104,1,0,0,51,289,1996.05,-27449.11,6230.62,...,2.0,0.00,-74887.42,0.0,5764.0,13324.52,7.0,0.0,10134.72,CONTINUA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
491058,101646174,202104,1,0,0,36,136,1699.97,11077.97,1676.17,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,CONTINUA
491059,129145708,202104,1,0,0,25,44,389.85,2712.16,223.13,...,2.0,0.00,-6308.59,0.0,1296.0,469.20,1.0,0.0,879.75,CONTINUA
491060,100589365,202103,1,0,0,44,138,1125.36,35348.63,1834.88,...,21.0,6518.51,-4486.92,0.0,3311.0,3669.42,5.0,0.0,340.17,CONTINUA
491061,101646174,202103,1,0,0,36,135,1713.82,10400.82,1707.24,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,CONTINUA
491062,155997426,202104,1,0,0,31,39,-843.72,2294.00,58.30,...,2.0,0.00,-6310.24,0.0,200.0,0.00,0.0,0.0,3120.18,CONTINUA

In [39]:
%%sql 
WITH final AS (
WITH agg AS (
    WITH base AS (
        SELECT *,
                MIN(foto_mes) OVER (PARTITION BY numero_de_cliente) AS primer_mes              
        FROM competencia_01
    )
    SELECT
        numero_de_cliente,
        primer_mes,
        MAX(CASE WHEN foto_mes = 202103 THEN 1 ELSE 0 END) AS foto_mes_202103,
        MAX(CASE WHEN foto_mes = 202104 THEN 1 ELSE 0 END) AS foto_mes_202104,
        MAX(CASE WHEN foto_mes = 202105 THEN 1 ELSE 0 END) AS foto_mes_202105,
        foto_mes_202103 + foto_mes_202104 + foto_mes_202105 AS suma
    FROM base
    GROUP BY numero_de_cliente, primer_mes
)
SELECT agg.numero_de_cliente, c.*,
    CASE WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 1) THEN 'CONTINUA'
         WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 1) THEN 'CONTINUA' 
         WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 0) THEN 'BAJA+1' 
         WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 0) THEN 'BAJA+2'
         WHEN (primer_mes = 202104) AND (foto_mes_202105 = 0)  THEN 'BAJA+1'
         ELSE NULL END AS clase_ternaria         
FROM agg
INNER JOIN competencia_01 c
ON c.numero_de_cliente = agg.numero_de_cliente
)
SELECT clase_ternaria, count(*) FROM final
GROUP BY clase_ternaria

  clase_ternaria  count_star()
0       CONTINUA        483935
1            NaN          4147
2         BAJA+1          1055
3         BAJA+2          1926

In [40]:
%%sql 
WITH final AS (
WITH agg AS (
    WITH base AS (
        SELECT *,
                MIN(foto_mes) OVER (PARTITION BY numero_de_cliente) AS primer_mes              
        FROM competencia_01
    )
    SELECT
        numero_de_cliente,
        primer_mes,
        MAX(CASE WHEN foto_mes = 202103 THEN 1 ELSE 0 END) AS foto_mes_202103,
        MAX(CASE WHEN foto_mes = 202104 THEN 1 ELSE 0 END) AS foto_mes_202104,
        MAX(CASE WHEN foto_mes = 202105 THEN 1 ELSE 0 END) AS foto_mes_202105,
        foto_mes_202103 + foto_mes_202104 + foto_mes_202105 AS suma
    FROM base
    GROUP BY numero_de_cliente, primer_mes
)
SELECT *,
    CASE WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 1) THEN 'CONTINUA'
         WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 1) THEN 'CONTINUA' 
         WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 0) THEN 'BAJA+1' 
         WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 0) THEN 'BAJA+2'
         WHEN (primer_mes = 202104) AND (foto_mes_202105 = 0)  THEN 'BAJA+1'
         ELSE NULL END AS clase_ternaria         
FROM agg
)
SELECT clase_ternaria, count(*) FROM final
GROUP BY clase_ternaria

  clase_ternaria  count_star()
0       CONTINUA        161312
1            NaN          2790
2         BAJA+1          1055
3         BAJA+2           963

In [ ]:
Hola! Comparto solución con SQL:
1. Identifico el primer mes que aparece el cliente
2. Hago un pivot con el campo foto_mes para identificar en qué meses está el cliente
3. Genero la clase ternaria
```
%%sql 
WITH agg AS (
    WITH min AS (
        SELECT *,
                MIN(foto_mes) OVER (PARTITION BY numero_de_cliente) AS primer_mes              
        FROM competencia_01
    )
    SELECT
        numero_de_cliente,
        primer_mes,
        MAX(CASE WHEN foto_mes = 202103 THEN 1 ELSE 0 END) AS foto_mes_202103,
        MAX(CASE WHEN foto_mes = 202104 THEN 1 ELSE 0 END) AS foto_mes_202104,
        MAX(CASE WHEN foto_mes = 202105 THEN 1 ELSE 0 END) AS foto_mes_202105,
    FROM min
    GROUP BY numero_de_cliente, primer_mes
)
SELECT c.*,
    CASE 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 1) THEN 'CONTINUA'
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 1) THEN 'CONTINUA' 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 0) THEN 'BAJA+1' 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 0) THEN 'BAJA+2'
        WHEN (primer_mes = 202104) AND (foto_mes_202105 = 0)  THEN 'BAJA+1'
        ELSE NULL END AS clase_ternaria         
FROM agg
LEFT JOIN competencia_01 c
ON c.numero_de_cliente = agg.numero_de_cliente```

Tiempo de ejecución  : 4.3s

Cantidad por clase:
CONTINUA    161.312
BAJA+1           1.055
BAJA+2           963
NA                     2.790

In [46]:
%%sql
WITH agg AS (
        WITH min AS (
            SELECT *,
                    MIN(foto_mes) OVER (PARTITION BY numero_de_cliente) AS primer_mes              
            FROM competencia_01
        )
        SELECT
            numero_de_cliente,
            primer_mes,
            MAX(CASE WHEN foto_mes = 202103 THEN 1 ELSE 0 END) AS foto_mes_202103,
            MAX(CASE WHEN foto_mes = 202104 THEN 1 ELSE 0 END) AS foto_mes_202104,
            MAX(CASE WHEN foto_mes = 202105 THEN 1 ELSE 0 END) AS foto_mes_202105,
            foto_mes_202103 + foto_mes_202104 + foto_mes_202105 AS suma
        FROM min
        GROUP BY numero_de_cliente, primer_mes
    )
SELECT c.*,
    CASE WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 1) THEN 'CONTINUA'
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 1) THEN 'CONTINUA' 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 0) THEN 'BAJA+1' 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 0) THEN 'BAJA+2'
        WHEN (primer_mes = 202104) AND (foto_mes_202105 = 0)  THEN 'BAJA+1'
        ELSE NULL END AS clase_ternaria         
FROM agg
LEFT JOIN competencia_01 c
ON c.numero_de_cliente = agg.numero_de_cliente

,numero_de_cliente,foto_mes,active_quarter,cliente_vip,internet,cliente_edad,cliente_antiguedad,mrentabilidad,mrentabilidad_annual,mcomisiones,...,Visa_fultimo_cierre,Visa_mpagado,Visa_mpagospesos,Visa_mpagosdolares,Visa_fechaalta,Visa_mconsumototal,Visa_cconsumos,Visa_cadelantosefectivo,Visa_mpagominimo,clase_ternaria
0,29202717,202103,1,0,0,71,263,3151.19,50457.47,1497.63,...,7.0,0.00,-19589.10,0.0,6428.0,5385.30,3.0,0.0,19436.61,CONTINUA
1,29249839,202103,1,0,0,67,159,7031.13,33387.15,117.20,...,1.0,0.00,NaN,NaN,1330.0,NaN,NaN,NaN,0.00,CONTINUA
2,29406732,202103,1,0,0,53,319,4622.78,73000.13,1926.06,...,1.0,0.00,-36333.42,0.0,3200.0,30950.93,5.0,0.0,3765.33,CONTINUA
3,29423068,202103,1,0,0,53,322,989.75,8190.98,1032.13,...,21.0,40662.39,-17643.80,0.0,8039.0,18058.44,6.0,0.0,2263.89,CONTINUA
4,29451915,202103,1,0,0,49,170,1638.15,2099.64,1776.90,...,7.0,0.00,-15233.57,0.0,5014.0,4245.21,2.0,0.0,328.44,CONTINUA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
491058,100589365,202104,1,0,0,44,139,1153.49,33979.10,1678.12,...,23.0,5707.64,-6518.51,0.0,3341.0,2868.16,4.0,0.0,293.25,CONTINUA
491059,129145708,202104,1,0,0,25,44,389.85,2712.16,223.13,...,2.0,0.00,-6308.59,0.0,1296.0,469.20,1.0,0.0,879.75,CONTINUA
491060,155997426,202103,1,0,0,31,38,-1133.12,3714.83,95.23,...,1.0,0.00,0.00,0.0,170.0,0.00,0.0,0.0,3178.83,CONTINUA
491061,101646174,202104,1,0,0,36,136,1699.97,11077.97,1676.17,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,CONTINUA
491062,155997426,202104,1,0,0,31,39,-843.72,2294.00,58.30,...,2.0,0.00,-6310.24,0.0,200.0,0.00,0.0,0.0,3120.18,CONTINUA

In [49]:
%%sql 
WITH agg AS (
    WITH min AS (
        SELECT *,
                MIN(foto_mes) OVER (PARTITION BY numero_de_cliente) AS primer_mes              
        FROM competencia_01
    )
    SELECT
        numero_de_cliente,
        primer_mes,
        MAX(CASE WHEN foto_mes = 202103 THEN 1 ELSE 0 END) AS foto_mes_202103,
        MAX(CASE WHEN foto_mes = 202104 THEN 1 ELSE 0 END) AS foto_mes_202104,
        MAX(CASE WHEN foto_mes = 202105 THEN 1 ELSE 0 END) AS foto_mes_202105,
        foto_mes_202103 + foto_mes_202104 + foto_mes_202105 AS suma
    FROM min
    GROUP BY numero_de_cliente, primer_mes
)
SELECT c.*,
    CASE WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 1) THEN 'CONTINUA'
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 1) THEN 'CONTINUA' 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 0) AND  (foto_mes_202105 = 0) THEN 'BAJA+1' 
        WHEN (primer_mes = 202103) AND (foto_mes_202104 = 1) AND  (foto_mes_202105 = 0) THEN 'BAJA+2'
        WHEN (primer_mes = 202104) AND (foto_mes_202105 = 0)  THEN 'BAJA+1'
        ELSE NULL END AS clase_ternaria         
FROM agg
LEFT JOIN competencia_01 c
ON c.numero_de_cliente = agg.numero_de_cliente

,numero_de_cliente,foto_mes,active_quarter,cliente_vip,internet,cliente_edad,cliente_antiguedad,mrentabilidad,mrentabilidad_annual,mcomisiones,...,Visa_fultimo_cierre,Visa_mpagado,Visa_mpagospesos,Visa_mpagosdolares,Visa_fechaalta,Visa_mconsumototal,Visa_cconsumos,Visa_cadelantosefectivo,Visa_mpagominimo,clase_ternaria
0,29359626,202105,1,0,0,65,280,5809.34,105416.11,2973.87,...,5.0,108822.10,0.00,0.0,8435.0,112440.60,31.0,0.0,35225.19,CONTINUA
1,29480122,202105,1,0,0,47,273,7650.95,162371.83,4111.89,...,26.0,77515.28,-82292.37,0.0,5811.0,30066.51,14.0,0.0,11530.59,CONTINUA
2,29519977,202105,1,0,0,54,293,1379.68,18999.99,2009.37,...,5.0,0.00,-120929.12,0.0,1497.0,30307.35,10.0,0.0,19530.45,CONTINUA
3,29586322,202105,1,0,0,52,377,11596.45,93612.00,2087.18,...,12.0,25807.85,-13389.79,0.0,5902.0,421.85,1.0,0.0,938.40,CONTINUA
4,29607262,202105,1,0,0,46,291,-5424.02,-15836.13,200.11,...,5.0,0.00,-32842.02,0.0,7295.0,16725.11,5.0,0.0,12480.72,CONTINUA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
491058,110971291,202105,1,0,0,29,62,1506.43,29950.59,156.04,...,5.0,0.00,-3996.76,0.0,1873.0,0.00,0.0,0.0,434.01,CONTINUA
491059,121029305,202105,1,0,0,28,93,3284.99,20593.02,215.08,...,5.0,0.00,-61200.58,0.0,2807.0,23564.83,11.0,0.0,4774.11,CONTINUA
491060,141885054,202105,1,0,0,39,56,1805.88,11277.74,567.83,...,5.0,0.00,-35077.70,0.0,553.0,7142.39,1.0,0.0,1161.27,CONTINUA
491061,150546496,202105,1,0,0,58,39,497.70,5506.75,134.35,...,5.0,0.00,NaN,NaN,1177.0,NaN,NaN,NaN,0.00,CONTINUA
491062,141065376,202105,1,0,0,40,57,1859.79,22700.10,1072.36,...,5.0,0.00,-25489.91,0.0,1700.0,5906.74,3.0,0.0,539.58,CONTINUA

Perfecto, ahora cree una nueva tabla con la variable adicional que se le pide. Algunas funciones que le pueden ser útiles:  [where](https://duckdb.org/docs/sql/query_syntax/where), [left join](https://duckdb.org/docs/sql/query_syntax/from), [case statement](https://duckdb.org/docs/sql/expressions/case)

In [ ]:
%%sql
-- escriba la query

## Ejercicio 1.1

* ¿Cuál es la nominalidad de cada clase?
* ¿Cuál es la proporción del target?

In [ ]:
%%sql
-- introduzca sus queries

Para guardar a un **.csv** simplemente debe ejecutar la siguiente sentencia

In [ ]:
%%sql
COPY competencia_01 TO '/home/aleb/dmeyf23/datasets/competencia_01.csv' (FORMAT CSV, HEADER)

## Ejercicio 2 - Avanzado
Use ahora el archivo `ejercicio_target.csv` y calcule para todos los clientes en todos los periodos su **clase_ternaria** al mismo tiempo